app/Http/Controllers/CapaianController.php

SELECT * FROM `tahuns`
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
---
    public function index($tahunID)
    {
        return view('Menu.Capaian.index', [
            'capaians' => Capaian::with('indikator.target.tujuan', 'tahun', 'user')->get(),
            'tahuns' => Tahun::all(),
            'tahunSinggle' => Tahun::findOrFail($tahunID),