app/Http/Controllers/DashboardController.php

    public function index(){
        return view('Menu.Dashboard.index', [
            'users' => User::Where('role_id', '!=', 1)->count(),
            'tujuans' => Tujuan::all()->count(),
            'indikators' => Indikator::all()->count()

        ]);
---
SELECT * FROM `indikators`
SELECT * FROM `tujuans`
SELECT count(*) as aggregate FROM `users` WHERE `role_id` != 1