app/Http/Controllers/KabkotaController.php

    public function index()
    {
        return view('Menu.SubkegiatanKabkota.index', [
            'kabkotas' => Kabkota::all(),
            // 'pkk' => ProgramKabKota::all(),
        ]);
---
SELECT * FROM `kabkotas`