app/Http/Controllers/KegiatanController.php

SELECT * FROM `kegiatans`
---
    public function index()
    {
        return view('Menu.Kegiatan.index',[
            'kegiatans' => Kegiatan::with('user')->get()
        ]);