app/Http/Controllers/LaporanPencapaianController.php

    public function index()
    {
         return view('Menu.LaporanPencapaian.index', [
             'laporan_pencapaians' => LaporanPencapaian::with('user')->get()
         ]);
---
SELECT * FROM `laporan_pencapaians`