app/Http/Controllers/MainController.php

SELECT * FROM `tujuans`
---
    public function index()
    {
        return view('index', [
            'tujuans' => Tujuan::all(),
            'tahun' => Carbon::now()->format('Y'),
        ]);