app/Http/Controllers/PelaporanPembelajaranController.php

    public function index()
    {
         return view('Menu.PelaporanPembelajaran.index', [
             'pelaporan_pembelajarans' => PelaporanPembelajaran::with('tujuan','user')->get()
         ]);
---
SELECT * FROM `pelaporan_pembelajarans`

    public function create()
    {
         return view('Menu.PelaporanPembelajaran.create',[
             'pelaporan_pembelajarans' => PelaporanPembelajaran::with('user')->get(),
             'tujuans' => Tujuan::all()
         ]);
---
SELECT * FROM `pelaporan_pembelajarans`
SELECT * FROM `tujuans`