app/Http/Controllers/PilarController.php

SELECT * FROM `pilars`
---
    public function index()
    {
        return view('Menu.Pilar.index', [
            'pilars' => Pilar::all()
        ]);