app/Http/Controllers/ProgramPemerintahPusatController.php

    public function index($tahunID)
    {
        return view('Menu.ProgramPemerintahPusat.index',[
            'tahunSinggle' => Tahun::findOrFail($tahunID),
            'tahuns' => Tahun::all(),
            'programs' => Program::all(),
            'program_pemerintah_pusats' => ProgramPemerintahPusat::with('indikator.target.tujuan','tahun','user', 'kegiatan.program')->get()
        ]);
---
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
SELECT * FROM `tahuns`
SELECT * FROM `programs`
SELECT * FROM `program_pemerintah_pusats`