app/Http/Controllers/ProgramPelakuUsahaController.php

SELECT * FROM `program_pelaku_usahas`
---
    public function index()
    {
        return view('Menu.ProgramPelakuUsaha.index',[
            'program_pelaku_usahas' => ProgramPelakuUsaha::with('user', 'indikator')->get()
        ]);