app/Http/Controllers/ProgramController.php

    public function index()
    {
        return view('Menu.Program.index',[
            'programs' => Program::with('user')->get()
        ]);
---
SELECT * FROM `programs`