app/Http/Controllers/ProgramKabKotaController.php

SELECT * FROM `tahuns`
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
---
    public function index($tahunID)
    {
         return view('Menu.ProgramKabKota.index',[
            'program_kab_kotas' => ProgramKabKota::with('kabkota.indikator.tujuan', 'tahun', 'user')->orderBy('id', 'DESC')->get(),
            'tahuns' => Tahun::all(),
            // 'sub_kegiatan' => SubKegiatan::all(),
            'tahunSinggle' => Tahun::findOrFail($tahunID),

SELECT * FROM `program_kab_kotas` ORDER BY `id` DESC
---
    public function create()
    {
        return view('Menu.ProgramKabKota.create',[
            'indikators' => Indikator::all(),
            'kabkotas' => Kabkota::all()
        ]);