app/Http/Controllers/ProgramPemerintahDaerahController.php

SELECT * FROM `tahuns`
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
---
    public function index($tahunID)
    {
         return view('Menu.ProgramPemerintahDaerah.index',[
            'program_pemerintah_daerahs' => ProgramPemerintahDaerah::with('indikator.target.tujuan', 'tahun', 'user')->get(),
            'tahuns' => Tahun::all(),
            // 'sub_kegiatan' => SubKegiatan::all(),
            'tahunSinggle' => Tahun::findOrFail($tahunID),

SELECT * FROM `program_pemerintah_daerahs`
---
    public function create()
    {
         return view('Menu.ProgramPemerintahDaerah.create',[
            'indikators' => Indikator::all(),
            'subkegiatans' => SubKegiatan::all()
        ]);