app/Http/Controllers/ProgramMitraSwastaController.php

    public function index($tahunID)
    {
         return view('Menu.ProgramMitraSwasta.index',[
            'tahunSinggle' => Tahun::findOrFail($tahunID),
            'output_kegiatans' => ProgramMitraSwasta::with('kegiatan.program','indikator.target.tujuan' ,'user')->get(),
        ]);
---
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
SELECT * FROM `program_mitra_swastas`