app/Http/Controllers/RencanaTindakLanjutController.php

    public function index()
    {
         return view('Menu.RencanaTindakLanjut.index',[
            'rencana_tindak_lanjuts' => RencanaTindakLanjut::with('indikator.target.tujuan','user', 'tujuan')->get()
        ]);
---
SELECT * FROM `rencana_tindak_lanjuts`