app/Http/Controllers/SubKegiatanController.php

SELECT * FROM `sub_kegiatans`
---
    public function index()
    {
        return view('Menu.SubKegiatan.index', [
            'subkegiatans' => SubKegiatan::all(),
        ]);