app/Http/Controllers/TargetController.php

    public function index()
    {
        return view('menu.Target.index', [
            'targets' => Target::with('tujuan')->get()
        ]);
---
SELECT * FROM `targets`
SELECT * FROM `tujuans` WHERE `tujuans`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17)