app/Http/Controllers/TujuanController.php

    public function index()
    {
        return view('Menu.Tujuan.index', [
            'tujuans' => Tujuan::all()
        ]);
---
SELECT * FROM `tujuans`