app/Http/Controllers/UserController.php

    public function index()
    {
        return view('Menu.User.index', [
            'users' => User::Where('role_id', '!=', 1)->get(),
            'user_1' => User::Where('role_id', '!=', 1)->get()
        ]);
---
SELECT * FROM `users` WHERE `role_id` != 1

    public function updateall($id)
    {
        $userupdate = User::Where('role_id', '!=', $id);



        $validateduser['status'] = "active";

        User::where('role_id', '!=', $id)->update($validateduser);
---
UPDATE `users` SET `status` = 'active', `users`.`updated_at` = '2022-09-16 13:07:10' WHERE `role_id` != '1'